app/Controllers/coord/ConveniosCoordController.php

    public function index()
    {
        $data = [
            'title' => 'Gestión de Convenios',
            'convenios' => $this->conveniosModel->getConveniosCompletos(),
            'instituciones' => $this->institucionesModel->getInstitucionesConTipo(),
            'tipos_convenios' => $this->tiposConveniosModel->findAll(),
            'carreras' => $this->carrerasModel->orderBy('NOMBRE')->findAll(),
---
SELECT *
FROM `TAB_TIPOS_CONVENIOS`
SELECT *
FROM `TAB_CARRERAS`
ORDER BY `NOMBRE`