app/Controllers/coord/DashboardCoordController.php

SELECT COUNT(*) AS `numrows`
FROM `TAB_ESTUDIANTES`
SELECT COUNT(*) AS `numrows`
FROM `TAB_INSTRUCTORES`
SELECT COUNT(*) AS `numrows`
FROM `TAB_INSTRUCTORES`
WHERE `ID_TIPO_INSTRUCTOR` = 1
SELECT COUNT(*) AS `numrows`
FROM `TAB_INSTRUCTORES`
WHERE `ID_TIPO_INSTRUCTOR` = 2
---
    private function obtenerMetricas()
    {
        // Verificar que los modelos estén inicializados
        if (!$this->estudiantesModel) {
            $this->estudiantesModel = new EstudiantesModel();
        }
        if (!$this->instructoresModel) {
            $this->instructoresModel = new InstructoresModel();
        }
        if (!$this->actividadesModel) {
            $this->actividadesModel = new ActividadesEducacionModel();
        }
        if (!$this->conveniosModel) {
            $this->conveniosModel = new DetallesConveniosModel();
        }

        try {
            // Total de estudiantes
            $totalEstudiantes = $this->estudiantesModel->countAllResults();
        } catch (\Exception $e) {
            log_message('error', 'Error al obtener total de estudiantes: ' . $e->getMessage());
            $totalEstudiantes = 0;
        }

        try {
            // Total de instructores (internos y externos)
            $totalInstructores = $this->instructoresModel->countAllResults();
            $instructoresInternos = (new InstructoresModel())->where('ID_TIPO_INSTRUCTOR', 1)->countAllResults();
            $instructoresExternos = (new InstructoresModel())->where('ID_TIPO_INSTRUCTOR', 2)->countAllResults();

SELECT `TAB_ACTIVIDADES_EDUCACION`.*, `ta`.`ACTIVIDAD`, `dp`.`NOMBRE`, `dp`.`APELLIDO`
FROM `TAB_ACTIVIDADES_EDUCACION`
LEFT JOIN `TAB_TIPOS_ACTIVIDADES` `ta` ON `ta`.`ID_TIPO_ACTIVIDAD` = `TAB_ACTIVIDADES_EDUCACION`.`ID_TIPO_ACTIVIDAD`
LEFT JOIN `TAB_INSTRUCTORES` `i` ON `i`.`ID_INSTRUCTOR` = `TAB_ACTIVIDADES_EDUCACION`.`ID_INSTRUCTOR`
LEFT JOIN `TAB_DATOS_PERSONAS` `dp` ON `dp`.`ID_DATO_PERSONA` = `i`.`ID_DATO_PERSONA`
ORDER BY `TAB_ACTIVIDADES_EDUCACION`.`FECHA_INICIO` DESC
 LIMIT 5
---
    private function obtenerActividadesRecientes()
    {
        // Verificar que los modelos estén inicializados
        if (!$this->actividadesModel) {
            $this->actividadesModel = new ActividadesEducacionModel();
        }
        if (!$this->practicasModel) {
            $this->practicasModel = new AsignacionesPracticasModel();
        }

        try {
            // Últimas 5 actividades educativas
            $actividades = $this->actividadesModel
                ->select('TAB_ACTIVIDADES_EDUCACION.*, ta.ACTIVIDAD, dp.NOMBRE, dp.APELLIDO')
                ->join('TAB_TIPOS_ACTIVIDADES ta', 'ta.ID_TIPO_ACTIVIDAD = TAB_ACTIVIDADES_EDUCACION.ID_TIPO_ACTIVIDAD', 'left')
                ->join('TAB_INSTRUCTORES i', 'i.ID_INSTRUCTOR = TAB_ACTIVIDADES_EDUCACION.ID_INSTRUCTOR', 'left')
                ->join('TAB_DATOS_PERSONAS dp', 'dp.ID_DATO_PERSONA = i.ID_DATO_PERSONA', 'left')
                ->orderBy('TAB_ACTIVIDADES_EDUCACION.FECHA_INICIO', 'DESC')
                ->limit(5)
                ->findAll();

SELECT `TAB_DETALLES_CONVENIOS`.*, `ic`.`NOMBRE` as `INSTITUCION`
FROM `TAB_DETALLES_CONVENIOS`
LEFT JOIN `TAB_INSTITUCIONES_CONVENIOS` `ic` ON `ic`.`ID_INSTITUCION_CONVENIO` = `TAB_DETALLES_CONVENIOS`.`ID_INSTITUCION_CONVENIO`
WHERE `TAB_DETALLES_CONVENIOS`.`FECHA_FIN` >= '2026-07-09'
AND `TAB_DETALLES_CONVENIOS`.`FECHA_FIN` <= '2026-08-08'
ORDER BY `TAB_DETALLES_CONVENIOS`.`FECHA_FIN` ASC
 LIMIT 5
SELECT `TAB_ASIGNACIONES_PRACTICAS`.*, `dp`.`NOMBRE`, `dp`.`APELLIDO`, `ic`.`NOMBRE` as `INSTITUCION`
FROM `TAB_ASIGNACIONES_PRACTICAS`
LEFT JOIN `TAB_USUARIOS` `u` ON `u`.`ID_USUARIO` = `TAB_ASIGNACIONES_PRACTICAS`.`ID_USUARIO`
LEFT JOIN `TAB_DATOS_PERSONAS` `dp` ON `dp`.`ID_DATO_PERSONA` = `u`.`ID_DATO_PERSONA`
LEFT JOIN `TAB_INSTITUCIONES_CONVENIOS` `ic` ON `ic`.`ID_INSTITUCION_CONVENIO` = `TAB_ASIGNACIONES_PRACTICAS`.`ID_INSTITUCION_CONVENIO`
WHERE TAB_ASIGNACIONES_PRACTICAS.FECHA_FIN IS NOT NULL
AND `TAB_ASIGNACIONES_PRACTICAS`.`FECHA_FIN` >= '2026-07-09'
AND `TAB_ASIGNACIONES_PRACTICAS`.`FECHA_FIN` <= '2026-08-08'
ORDER BY `TAB_ASIGNACIONES_PRACTICAS`.`FECHA_FIN` ASC
 LIMIT 5
---
    private function obtenerVencimientosProximos()
    {
        // Verificar que los modelos estén inicializados
        if (!$this->conveniosModel) {
            $this->conveniosModel = new DetallesConveniosModel();
        }
        if (!$this->practicasModel) {
            $this->practicasModel = new AsignacionesPracticasModel();
        }

        try {
            // Convenios que vencen en los próximos 30 días
            $conveniosPorVencer = $this->conveniosModel
                ->select('TAB_DETALLES_CONVENIOS.*, ic.NOMBRE as INSTITUCION')
                ->join('TAB_INSTITUCIONES_CONVENIOS ic', 'ic.ID_INSTITUCION_CONVENIO = TAB_DETALLES_CONVENIOS.ID_INSTITUCION_CONVENIO', 'left')
                ->where('TAB_DETALLES_CONVENIOS.FECHA_FIN >=', date('Y-m-d'))
                ->where('TAB_DETALLES_CONVENIOS.FECHA_FIN <=', date('Y-m-d', strtotime('+30 days')))
                ->orderBy('TAB_DETALLES_CONVENIOS.FECHA_FIN', 'ASC')
                ->limit(5)
                ->findAll();
        } catch (\Exception $e) {
            log_message('error', 'Error al obtener convenios por vencer: ' . $e->getMessage());
            $conveniosPorVencer = [];
        }

        try {
            // Prácticas que terminan pronto
            $practicasPorTerminar = $this->practicasModel
                ->select('TAB_ASIGNACIONES_PRACTICAS.*, dp.NOMBRE, dp.APELLIDO, ic.NOMBRE as INSTITUCION')
                ->join('TAB_USUARIOS u', 'u.ID_USUARIO = TAB_ASIGNACIONES_PRACTICAS.ID_USUARIO', 'left')
                ->join('TAB_DATOS_PERSONAS dp', 'dp.ID_DATO_PERSONA = u.ID_DATO_PERSONA', 'left')
                ->join('TAB_INSTITUCIONES_CONVENIOS ic', 'ic.ID_INSTITUCION_CONVENIO = TAB_ASIGNACIONES_PRACTICAS.ID_INSTITUCION_CONVENIO', 'left')
                ->where('TAB_ASIGNACIONES_PRACTICAS.FECHA_FIN IS NOT NULL', null, false)
                ->where('TAB_ASIGNACIONES_PRACTICAS.FECHA_FIN >=', date('Y-m-d'))
                ->where('TAB_ASIGNACIONES_PRACTICAS.FECHA_FIN <=', date('Y-m-d', strtotime('+30 days')))
                ->orderBy('TAB_ASIGNACIONES_PRACTICAS.FECHA_FIN', 'ASC')
                ->limit(5)
                ->findAll();