app/Controllers/coord/InstructoresCoordController.php

    public function index()
    {
        $data = [
            'title' => 'Instructores externos',
            'instructores' => $this->instructoresModel->getInstructoresConDatos(),
            'tiposInstructores' => $this->tipoInstructoresModel->findAll()
        ];
---
SELECT *
FROM `TAB_TIPOS_INSTRUCTORES`

    public function getEstadisticas()
    {
        try {
            $idTipoExterno = $this->obtenerIdTipoInstructorExterno();
            $totalInstructores = 0;
            $instructoresActivos = 0;
            if ($idTipoExterno) {
                $totalInstructores = (int) $this->db->table('TAB_INSTRUCTORES')
                    ->where('ID_TIPO_INSTRUCTOR', $idTipoExterno)
                    ->countAllResults();
                $instructoresActivos = (int) $this->db->table('TAB_INSTRUCTORES i')
                    ->join('TAB_DATOS_PERSONAS dp', 'dp.ID_DATO_PERSONA = i.ID_DATO_PERSONA')
                    ->where('i.ID_TIPO_INSTRUCTOR', $idTipoExterno)
                    ->where('dp.ACTIVO', 1)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `TAB_INSTRUCTORES`
WHERE `ID_TIPO_INSTRUCTOR` = 2
SELECT COUNT(*) AS `numrows`
FROM `TAB_INSTRUCTORES` `i`
JOIN `TAB_DATOS_PERSONAS` `dp` ON `dp`.`ID_DATO_PERSONA` = `i`.`ID_DATO_PERSONA`
WHERE `i`.`ID_TIPO_INSTRUCTOR` = 2
AND `dp`.`ACTIVO` = 1