app/Controllers/coord/PracticasCoordController.php


            if (!empty($serviciosComunitarios) && $tiposServicioCount > 0) {
                $idsServicios = array_map('intval', array_column($serviciosComunitarios, 'ID_SERVICIO_COMUNITARIO'));
                $docsPorServicio = $this->documentosServicioComunitarioModel
                    ->select('ID_SERVICIO_COMUNITARIO, COUNT(DISTINCT ID_TIPO_DOCUMENTO) AS docs_subidos')
                    ->whereIn('ID_SERVICIO_COMUNITARIO', $idsServicios)
                    ->groupBy('ID_SERVICIO_COMUNITARIO')
                    ->findAll();
---
SELECT `ID_SERVICIO_COMUNITARIO`, COUNT(DISTINCT ID_TIPO_DOCUMENTO) AS docs_subidos
FROM `TAB_DOCUMENTOS_SERVICIO_COMUNITARIO`
WHERE `ID_SERVICIO_COMUNITARIO` IN (2,1)
GROUP BY `ID_SERVICIO_COMUNITARIO`


        $carreras = [];
        try {
            $carreras = $this->carrerasModel->orderBy('NOMBRE')->findAll();
---
SELECT *
FROM `TAB_CARRERAS`
ORDER BY `NOMBRE`

    private function obtenerEstadisticas()
    {
        $db = \Config\Database::connect();

        // Total de prácticas preprofesionales
        $totalPreprofesionales = $db->table('TAB_PRACTICAS_PREPROFESIONALES')->countAllResults();

        // Total de servicios comunitarios
        $totalServicios = $db->table('TAB_SERVICIO_COMUNITARIO')->countAllResults();

        // Prácticas activas (en progreso)
        $activasPreprofesionales = $db->table('TAB_PRACTICAS_PREPROFESIONALES')
            ->where('ESTADO_PRACTICA', 'En Progreso')
            ->countAllResults();

        $activasServicios = $db->table('TAB_SERVICIO_COMUNITARIO')
            ->where('ESTADO_SERVICIO', 'En Progreso')
            ->countAllResults();

        // Prácticas finalizadas
        $finalizadasPreprofesionales = $db->table('TAB_PRACTICAS_PREPROFESIONALES')
            ->where('ESTADO_PRACTICA', 'Completada')
            ->countAllResults();

        $finalizadasServicios = $db->table('TAB_SERVICIO_COMUNITARIO')
            ->where('ESTADO_SERVICIO', 'Completado')
            ->countAllResults();

        // Prácticas pendientes
        $pendientesPreprofesionales = $db->table('TAB_PRACTICAS_PREPROFESIONALES')
            ->where('ESTADO_PRACTICA', 'Pendiente')
            ->countAllResults();

        $pendientesServicios = $db->table('TAB_SERVICIO_COMUNITARIO')
            ->where('ESTADO_SERVICIO', 'Pendiente')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `TAB_PRACTICAS_PREPROFESIONALES`
SELECT COUNT(*) AS `numrows`
FROM `TAB_SERVICIO_COMUNITARIO`
SELECT COUNT(*) AS `numrows`
FROM `TAB_PRACTICAS_PREPROFESIONALES`
WHERE `ESTADO_PRACTICA` = 'En Progreso'
SELECT COUNT(*) AS `numrows`
FROM `TAB_SERVICIO_COMUNITARIO`
WHERE `ESTADO_SERVICIO` = 'En Progreso'
SELECT COUNT(*) AS `numrows`
FROM `TAB_PRACTICAS_PREPROFESIONALES`
WHERE `ESTADO_PRACTICA` = 'Completada'
SELECT COUNT(*) AS `numrows`
FROM `TAB_SERVICIO_COMUNITARIO`
WHERE `ESTADO_SERVICIO` = 'Completado'
SELECT COUNT(*) AS `numrows`
FROM `TAB_PRACTICAS_PREPROFESIONALES`
WHERE `ESTADO_PRACTICA` = 'Pendiente'
SELECT COUNT(*) AS `numrows`
FROM `TAB_SERVICIO_COMUNITARIO`
WHERE `ESTADO_SERVICIO` = 'Pendiente'