.zip/app/Services/CoordinadorVinculacionContactoService.php

    public static function obtenerDatosWhatsapp(BaseConnection $db): ?array
    {
        try {
            $row = $db->table('TAB_USUARIOS u')
                ->select('dp.CELULAR, dp.NOMBRE, dp.APELLIDO')
                ->join('TAB_DATOS_PERSONAS dp', 'dp.ID_DATO_PERSONA = u.ID_DATO_PERSONA')
                ->join('TAB_ROLES r', 'r.ID_USUARIO = u.ID_USUARIO')
                ->join('TAB_TIPOS_ROLES tr', 'tr.ID_TIPOS_ROLES = r.ID_TIPOS_ROLES')
                ->where('tr.ID_TIPOS_ROLES', 1)
                ->where('u.ESTADO', '1')
                ->orderBy('u.ID_USUARIO', 'ASC')
                ->limit(1)
                ->get()
                ->getRowArray();
---
SELECT `dp`.`CELULAR`, `dp`.`NOMBRE`, `dp`.`APELLIDO`
FROM `TAB_USUARIOS` `u`
JOIN `TAB_DATOS_PERSONAS` `dp` ON `dp`.`ID_DATO_PERSONA` = `u`.`ID_DATO_PERSONA`
JOIN `TAB_ROLES` `r` ON `r`.`ID_USUARIO` = `u`.`ID_USUARIO`
JOIN `TAB_TIPOS_ROLES` `tr` ON `tr`.`ID_TIPOS_ROLES` = `r`.`ID_TIPOS_ROLES`
WHERE `tr`.`ID_TIPOS_ROLES` = 1
AND `u`.`ESTADO` = '1'
ORDER BY `u`.`ID_USUARIO` ASC
 LIMIT 1