.zip/app/Services/EstudianteAsistenciaService.php

    public static function obtenerIdEstudiantePorUsuario(int $idUsuario): ?int
    {
        $db = Database::connect();
        $row = $db->table('TAB_ESTUDIANTES e')
            ->select('e.ID_ESTUDIANTE')
            ->join('TAB_USUARIOS u', 'u.ID_DATO_PERSONA = e.ID_DATO_PERSONA')
            ->where('u.ID_USUARIO', $idUsuario)
            ->get()
            ->getRowArray();
---
SELECT `e`.`ID_ESTUDIANTE`
FROM `TAB_ESTUDIANTES` `e`
JOIN `TAB_USUARIOS` `u` ON `u`.`ID_DATO_PERSONA` = `e`.`ID_DATO_PERSONA`
WHERE `u`.`ID_USUARIO` = 4

    public static function pendientesAsistenciaHoy(int $idUsuario, ?string $fecha = null): array
    {
        $fechaDia = $fecha ?? date('Y-m-d');
        $idEst = self::obtenerIdEstudiantePorUsuario($idUsuario);
        if ($idEst === null) {
            return ['debe_registrar' => false, 'items' => [], 'fecha' => $fechaDia];
        }

        $db = Database::connect();
        $items = [];

        $pps = $db->table('TAB_PRACTICAS_PREPROFESIONALES')
            ->where('ID_ESTUDIANTE', $idEst)
            ->where('ESTADO_PRACTICA', self::ESTADO_PP_ACTIVO)
            ->get()
            ->getResultArray();

        foreach ($pps as $pp) {
            $idP = (int) ($pp['ID_PRACTICA_PREPROFESIONAL'] ?? 0);
            if ($idP <= 0) {
                continue;
            }
            $n = $db->table('TAB_ASISTENCIAS_PRACTICAS_PREPROFESIONALES')
                ->where('ID_PRACTICA_PREPROFESIONAL', $idP)
                ->where('FECHA_ASISTENCIA', $fechaDia)
                ->countAllResults();
---
SELECT *
FROM `TAB_PRACTICAS_PREPROFESIONALES`
WHERE `ID_ESTUDIANTE` = 1
AND `ESTADO_PRACTICA` = 'En Progreso'
SELECT COUNT(*) AS `numrows`
FROM `TAB_ASISTENCIAS_PRACTICAS_PREPROFESIONALES`
WHERE `ID_PRACTICA_PREPROFESIONAL` = 1
AND `FECHA_ASISTENCIA` = '2026-07-09'

            }
        }

        $scs = $db->table('TAB_SERVICIO_COMUNITARIO')
            ->where('ID_ESTUDIANTE', $idEst)
            ->where('ESTADO_SERVICIO', self::ESTADO_SC_ACTIVO)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `TAB_SERVICIO_COMUNITARIO`
WHERE `ID_ESTUDIANTE` = 1
AND `ESTADO_SERVICIO` = 'En Progreso'