.zip/app/Models/InstitucionesConveniosModel.php

SELECT `ic`.*, `ti`.`INSTITUCION` as `TIPO_INSTITUCION`
FROM `TAB_INSTITUCIONES_CONVENIOS` `ic`
JOIN `TAB_TIPOS_INSTITUCION` `ti` ON `ti`.`ID_TIPO_INSTITUCION` = `ic`.`ID_TIPO_INSTITUCION`
---
    public function getInstitucionesConTipo()
    {
        $builder = $this->db->table('TAB_INSTITUCIONES_CONVENIOS ic')
            ->select('ic.*, ti.INSTITUCION as TIPO_INSTITUCION')
            ->join('TAB_TIPOS_INSTITUCION ti', 'ti.ID_TIPO_INSTITUCION = ic.ID_TIPO_INSTITUCION');

        return $builder->get()->getResultArray();