.zip/app/Models/InstructoresModel.php

SELECT `i`.*, `dp`.`NOMBRE`, `dp`.`APELLIDO`, `dp`.`CEDULA`, `dp`.`EMAIL`, `dp`.`CELULAR`, `dp`.`DIRECCION`, `dp`.`GENERO`, `dp`.`ESTADO_CIVIL`, `dp`.`NACIONALIDAD`, `dp`.`FOTO_URL`, `ti`.`TIPO` as `TIPO_INSTRUCTOR`
FROM `TAB_INSTRUCTORES` `i`
JOIN `TAB_DATOS_PERSONAS` `dp` ON `dp`.`ID_DATO_PERSONA` = `i`.`ID_DATO_PERSONA`
JOIN `TAB_TIPOS_INSTRUCTORES` `ti` ON `ti`.`ID_TIPO_INSTRUCTOR` = `i`.`ID_TIPO_INSTRUCTOR`
WHERE `dp`.`ACTIVO` = 1
ORDER BY `dp`.`NOMBRE` ASC
---
    public function getInstructoresConDatos()
    {
        $builder = $this->db->table('TAB_INSTRUCTORES i')
            ->select('i.*, dp.NOMBRE, dp.APELLIDO, dp.CEDULA, dp.EMAIL, dp.CELULAR, dp.DIRECCION, dp.GENERO, dp.ESTADO_CIVIL, dp.NACIONALIDAD, dp.FOTO_URL, ti.TIPO as TIPO_INSTRUCTOR')
            ->join('TAB_DATOS_PERSONAS dp', 'dp.ID_DATO_PERSONA = i.ID_DATO_PERSONA')
            ->join('TAB_TIPOS_INSTRUCTORES ti', 'ti.ID_TIPO_INSTRUCTOR = i.ID_TIPO_INSTRUCTOR')
            ->where('dp.ACTIVO', 1)
            ->orderBy('dp.NOMBRE', 'ASC');

        return $builder->get()->getResultArray();