.zip/app/Models/TiposDocumentosServicioComunitarioModel.php

    public function getAllTipos()
    {
        return $this->where('ACTIVO', 1)
                   ->orderBy('ORDEN', 'ASC')
                   ->orderBy('CODIGO', 'ASC')
                   ->findAll();
---
SELECT *
FROM `TAB_TIPOS_DOCUMENTOS_SERVICIO_COMUNITARIO`
WHERE `ACTIVO` = 1
ORDER BY `ORDEN` ASC, `CODIGO` ASC