app/Controllers/estudiante/DashboardEstudianteController.php

    public function index()
    {
        // Verificar que el usuario esté logueado y sea estudiante
        if (!session()->get('logged_in') || session()->get('rol') != 3) {
            return redirect()->to('/');
        }

        $idUsuario = session()->get('id_usuario');

        // Buscar estudiante: TAB_ESTUDIANTES se relaciona con usuario por ID_DATO_PERSONA (vía TAB_USUARIOS)
        $estudiante = null;
        $idDatoPersona = null;
        $usuario = $this->db->table('TAB_USUARIOS')->where('ID_USUARIO', $idUsuario)->get()->getRowArray();
---
SELECT *
FROM `TAB_USUARIOS`
WHERE `ID_USUARIO` = '4'

        $preprofesionalesActivas = 0;
        $practicasPreprofesionales = [];
        try {
            $totalPreprofesionales = $this->db->table('TAB_PRACTICAS_PREPROFESIONALES pp')
                ->join('TAB_ESTUDIANTES e', 'e.ID_ESTUDIANTE = pp.ID_ESTUDIANTE')
                ->where('e.ID_DATO_PERSONA', $idDatoPersona)
                ->countAllResults();

            $preprofesionalesActivas = $this->db->table('TAB_PRACTICAS_PREPROFESIONALES pp')
                ->join('TAB_ESTUDIANTES e', 'e.ID_ESTUDIANTE = pp.ID_ESTUDIANTE')
                ->where('e.ID_DATO_PERSONA', $idDatoPersona)
                ->where('pp.ESTADO_PRACTICA', 'En Progreso')
                ->countAllResults();

            $practicasPreprofesionales = $this->db->table('TAB_PRACTICAS_PREPROFESIONALES pp')
                ->select('pp.*, ic.NOMBRE as INSTITUCION_NOMBRE')
                ->join('TAB_ESTUDIANTES e', 'e.ID_ESTUDIANTE = pp.ID_ESTUDIANTE')
                ->join($tblInstituciones . ' ic', 'ic.ID_INSTITUCION_CONVENIO = pp.ID_INSTITUCION_CONVENIO', 'left')
                ->where('e.ID_DATO_PERSONA', $idDatoPersona)
                ->orderBy('pp.FECHA_INICIO', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `TAB_PRACTICAS_PREPROFESIONALES` `pp`
JOIN `TAB_ESTUDIANTES` `e` ON `e`.`ID_ESTUDIANTE` = `pp`.`ID_ESTUDIANTE`
WHERE `e`.`ID_DATO_PERSONA` = '4'
SELECT COUNT(*) AS `numrows`
FROM `TAB_PRACTICAS_PREPROFESIONALES` `pp`
JOIN `TAB_ESTUDIANTES` `e` ON `e`.`ID_ESTUDIANTE` = `pp`.`ID_ESTUDIANTE`
WHERE `e`.`ID_DATO_PERSONA` = '4'
AND `pp`.`ESTADO_PRACTICA` = 'En Progreso'
SELECT `pp`.*, `ic`.`NOMBRE` as `INSTITUCION_NOMBRE`
FROM `TAB_PRACTICAS_PREPROFESIONALES` `pp`
JOIN `TAB_ESTUDIANTES` `e` ON `e`.`ID_ESTUDIANTE` = `pp`.`ID_ESTUDIANTE`
LEFT JOIN `TAB_INSTITUCIONES_CONVENIOS` `ic` ON `ic`.`ID_INSTITUCION_CONVENIO` = `pp`.`ID_INSTITUCION_CONVENIO`
WHERE `e`.`ID_DATO_PERSONA` = '4'
ORDER BY `pp`.`FECHA_INICIO` DESC
 LIMIT 5

        $servicioComunitarioActivos = 0;
        $serviciosComunitarios = [];
        try {
            $totalServicioComunitario = $this->db->table('TAB_SERVICIO_COMUNITARIO sc')
                ->join('TAB_ESTUDIANTES e', 'e.ID_ESTUDIANTE = sc.ID_ESTUDIANTE')
                ->where('e.ID_DATO_PERSONA', $idDatoPersona)
                ->countAllResults();
            $servicioComunitarioActivos = $this->db->table('TAB_SERVICIO_COMUNITARIO sc')
                ->join('TAB_ESTUDIANTES e', 'e.ID_ESTUDIANTE = sc.ID_ESTUDIANTE')
                ->where('e.ID_DATO_PERSONA', $idDatoPersona)
                ->where('sc.ESTADO_SERVICIO', 'En Progreso')
                ->countAllResults();
            $serviciosComunitarios = $this->db->table('TAB_SERVICIO_COMUNITARIO sc')
                ->select('sc.*, ic.NOMBRE as INSTITUCION_NOMBRE')
                ->join('TAB_ESTUDIANTES e', 'e.ID_ESTUDIANTE = sc.ID_ESTUDIANTE')
                ->join($tblInstituciones . ' ic', 'ic.ID_INSTITUCION_CONVENIO = sc.ID_INSTITUCION_CONVENIO', 'left')
                ->where('e.ID_DATO_PERSONA', $idDatoPersona)
                ->orderBy('sc.FECHA_INICIO', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `TAB_SERVICIO_COMUNITARIO` `sc`
JOIN `TAB_ESTUDIANTES` `e` ON `e`.`ID_ESTUDIANTE` = `sc`.`ID_ESTUDIANTE`
WHERE `e`.`ID_DATO_PERSONA` = '4'
SELECT COUNT(*) AS `numrows`
FROM `TAB_SERVICIO_COMUNITARIO` `sc`
JOIN `TAB_ESTUDIANTES` `e` ON `e`.`ID_ESTUDIANTE` = `sc`.`ID_ESTUDIANTE`
WHERE `e`.`ID_DATO_PERSONA` = '4'
AND `sc`.`ESTADO_SERVICIO` = 'En Progreso'
SELECT `sc`.*, `ic`.`NOMBRE` as `INSTITUCION_NOMBRE`
FROM `TAB_SERVICIO_COMUNITARIO` `sc`
JOIN `TAB_ESTUDIANTES` `e` ON `e`.`ID_ESTUDIANTE` = `sc`.`ID_ESTUDIANTE`
LEFT JOIN `TAB_INSTITUCIONES_CONVENIOS` `ic` ON `ic`.`ID_INSTITUCION_CONVENIO` = `sc`.`ID_INSTITUCION_CONVENIO`
WHERE `e`.`ID_DATO_PERSONA` = '4'
ORDER BY `sc`.`FECHA_INICIO` DESC
 LIMIT 5