app/Models/DetallesConveniosModel.php

    public function getConveniosCompletos()
    {
        $builder = $this->db->table('TAB_DETALLES_CONVENIOS dc')
            ->join('TAB_INSTITUCIONES_CONVENIOS ic', 'ic.ID_INSTITUCION_CONVENIO = dc.ID_INSTITUCION_CONVENIO')
            ->join('TAB_TIPOS_CONVENIOS tc', 'tc.ID_TIPO_CONVENIO = dc.ID_TIPO_CONVENIO')
            ->join('TAB_TIPOS_INSTITUCION ti', 'ti.ID_TIPO_INSTITUCION = ic.ID_TIPO_INSTITUCION');

        if ($this->tieneColumnaCarrera()) {
            $builder->select('dc.*, ic.NOMBRE, ic.RUC, ic.REPRESENTANTE_LEGAL, ic.LOGO, tc.CONVENIO as TIPO_CONVENIO, ti.INSTITUCION as TIPO_INSTITUCION, c.NOMBRE as CARRERA_NOMBRE')
                ->join('TAB_CARRERAS c', 'c.ID_CARRERA = dc.ID_CARRERA', 'left');
        } else {
            $builder->select('dc.*, ic.NOMBRE, ic.RUC, ic.REPRESENTANTE_LEGAL, ic.LOGO, tc.CONVENIO as TIPO_CONVENIO, ti.INSTITUCION as TIPO_INSTITUCION, NULL as CARRERA_NOMBRE');
        }

        return $builder->get()->getResultArray();
---
SELECT `dc`.*, `ic`.`NOMBRE`, `ic`.`RUC`, `ic`.`REPRESENTANTE_LEGAL`, `ic`.`LOGO`, `tc`.`CONVENIO` as `TIPO_CONVENIO`, `ti`.`INSTITUCION` as `TIPO_INSTITUCION`, `c`.`NOMBRE` as `CARRERA_NOMBRE`
FROM `TAB_DETALLES_CONVENIOS` `dc`
JOIN `TAB_INSTITUCIONES_CONVENIOS` `ic` ON `ic`.`ID_INSTITUCION_CONVENIO` = `dc`.`ID_INSTITUCION_CONVENIO`
JOIN `TAB_TIPOS_CONVENIOS` `tc` ON `tc`.`ID_TIPO_CONVENIO` = `dc`.`ID_TIPO_CONVENIO`
JOIN `TAB_TIPOS_INSTITUCION` `ti` ON `ti`.`ID_TIPO_INSTITUCION` = `ic`.`ID_TIPO_INSTITUCION`
LEFT JOIN `TAB_CARRERAS` `c` ON `c`.`ID_CARRERA` = `dc`.`ID_CARRERA`