app/Models/PracticasPreprofesionalesModel.php

SELECT `pp`.*, CONCAT(dp.NOMBRE, " ", dp.APELLIDO) as ESTUDIANTE_NOMBRE, `c`.`NOMBRE` as `CARRERA_NOMBRE`, `ic`.`NOMBRE` as `INSTITUCION_NOMBRE`, `ti`.`INSTITUCION` as `TIPO_INSTITUCION`, CONCAT(dpdt.NOMBRE, " ", dpdt.APELLIDO) as INSTRUCTOR_NOMBRE
FROM `TAB_PRACTICAS_PREPROFESIONALES` `pp`
JOIN `TAB_ESTUDIANTES` `e` ON `e`.`ID_ESTUDIANTE` = `pp`.`ID_ESTUDIANTE`
JOIN `TAB_DATOS_PERSONAS` `dp` ON `dp`.`ID_DATO_PERSONA` = `e`.`ID_DATO_PERSONA`
JOIN `TAB_CARRERAS` `c` ON `c`.`ID_CARRERA` = `e`.`ID_CARRERA`
JOIN `TAB_INSTITUCIONES_CONVENIOS` `ic` ON `ic`.`ID_INSTITUCION_CONVENIO` = `pp`.`ID_INSTITUCION_CONVENIO`
JOIN `TAB_TIPOS_INSTITUCION` `ti` ON `ti`.`ID_TIPO_INSTITUCION` = `ic`.`ID_TIPO_INSTITUCION`
LEFT JOIN `TAB_DOCENTES_TUTORES` `dt` ON `dt`.`ID_DOCENTE_TUTOR` = `pp`.`ID_DOCENTE_TUTOR`
LEFT JOIN `TAB_DATOS_PERSONAS` `dpdt` ON `dpdt`.`ID_DATO_PERSONA` = `dt`.`ID_DATO_PERSONA`
ORDER BY `pp`.`ID_PRACTICA_PREPROFESIONAL` DESC
---
    public function getListaParaCoordinador()
    {
        $builder = $this->db->table('TAB_PRACTICAS_PREPROFESIONALES pp')
            ->select('
                pp.*,
                CONCAT(dp.NOMBRE, " ", dp.APELLIDO) as ESTUDIANTE_NOMBRE,
                c.NOMBRE as CARRERA_NOMBRE,
                ic.NOMBRE as INSTITUCION_NOMBRE,
                ti.INSTITUCION as TIPO_INSTITUCION,
                CONCAT(dpdt.NOMBRE, " ", dpdt.APELLIDO) as INSTRUCTOR_NOMBRE
            ')
            ->join('TAB_ESTUDIANTES e', 'e.ID_ESTUDIANTE = pp.ID_ESTUDIANTE')
            ->join('TAB_DATOS_PERSONAS dp', 'dp.ID_DATO_PERSONA = e.ID_DATO_PERSONA')
            ->join('TAB_CARRERAS c', 'c.ID_CARRERA = e.ID_CARRERA')
            ->join('TAB_INSTITUCIONES_CONVENIOS ic', 'ic.ID_INSTITUCION_CONVENIO = pp.ID_INSTITUCION_CONVENIO')
            ->join('TAB_TIPOS_INSTITUCION ti', 'ti.ID_TIPO_INSTITUCION = ic.ID_TIPO_INSTITUCION')
            ->join('TAB_DOCENTES_TUTORES dt', 'dt.ID_DOCENTE_TUTOR = pp.ID_DOCENTE_TUTOR', 'left')
            ->join('TAB_DATOS_PERSONAS dpdt', 'dpdt.ID_DATO_PERSONA = dt.ID_DATO_PERSONA', 'left')
            ->orderBy('pp.ID_PRACTICA_PREPROFESIONAL', 'DESC');

        return $builder->get()->getResultArray();