app/Models/ServiciosComunitariosModel.php

    public function getListaParaAdmin()
    {
        $builder = $this->db->table('TAB_SERVICIO_COMUNITARIO sc')
            ->select('
                sc.*,
                CONCAT(dp.NOMBRE, " ", dp.APELLIDO) as ESTUDIANTE_NOMBRE,
                c.NOMBRE as CARRERA_NOMBRE,
                ic.NOMBRE as INSTITUCION_NOMBRE,
                ti.INSTITUCION as TIPO_INSTITUCION,
                CONCAT(dpi.NOMBRE, " ", dpi.APELLIDO) as INSTRUCTOR_NOMBRE
            ')
            ->join('TAB_ESTUDIANTES e', 'e.ID_ESTUDIANTE = sc.ID_ESTUDIANTE')
            ->join('TAB_DATOS_PERSONAS dp', 'dp.ID_DATO_PERSONA = e.ID_DATO_PERSONA')
            ->join('TAB_CARRERAS c', 'c.ID_CARRERA = e.ID_CARRERA')
            ->join('TAB_INSTITUCIONES_CONVENIOS ic', 'ic.ID_INSTITUCION_CONVENIO = sc.ID_INSTITUCION_CONVENIO')
            ->join('TAB_TIPOS_INSTITUCION ti', 'ti.ID_TIPO_INSTITUCION = ic.ID_TIPO_INSTITUCION')
            ->join('TAB_INSTRUCTORES i', 'i.ID_INSTRUCTOR = sc.ID_INSTRUCTOR', 'left')
            ->join('TAB_DATOS_PERSONAS dpi', 'dpi.ID_DATO_PERSONA = i.ID_DATO_PERSONA', 'left')
            ->orderBy('sc.ID_SERVICIO_COMUNITARIO', 'DESC');

        return $builder->get()->getResultArray();
---
SELECT `sc`.*, CONCAT(dp.NOMBRE, " ", dp.APELLIDO) as ESTUDIANTE_NOMBRE, `c`.`NOMBRE` as `CARRERA_NOMBRE`, `ic`.`NOMBRE` as `INSTITUCION_NOMBRE`, `ti`.`INSTITUCION` as `TIPO_INSTITUCION`, CONCAT(dpdt.NOMBRE, " ", dpdt.APELLIDO) as INSTRUCTOR_NOMBRE
FROM `TAB_SERVICIO_COMUNITARIO` `sc`
JOIN `TAB_ESTUDIANTES` `e` ON `e`.`ID_ESTUDIANTE` = `sc`.`ID_ESTUDIANTE`
JOIN `TAB_DATOS_PERSONAS` `dp` ON `dp`.`ID_DATO_PERSONA` = `e`.`ID_DATO_PERSONA`
JOIN `TAB_CARRERAS` `c` ON `c`.`ID_CARRERA` = `e`.`ID_CARRERA`
JOIN `TAB_INSTITUCIONES_CONVENIOS` `ic` ON `ic`.`ID_INSTITUCION_CONVENIO` = `sc`.`ID_INSTITUCION_CONVENIO`
JOIN `TAB_TIPOS_INSTITUCION` `ti` ON `ti`.`ID_TIPO_INSTITUCION` = `ic`.`ID_TIPO_INSTITUCION`
LEFT JOIN `TAB_DOCENTES_TUTORES` `dt` ON `dt`.`ID_DOCENTE_TUTOR` = `sc`.`ID_DOCENTE_TUTOR`
LEFT JOIN `TAB_DATOS_PERSONAS` `dpdt` ON `dpdt`.`ID_DATO_PERSONA` = `dt`.`ID_DATO_PERSONA`
ORDER BY `sc`.`ID_SERVICIO_COMUNITARIO` DESC